app/Exports/MonHocExport.php

select * from `mon_hoc` inner join `chuyen_nganh` on `mon_hoc`.`ma_chuyen_nganh` = `chuyen_nganh`.`ma_chuyen_nganh` where `ten_mon_hoc` LIKE '%MCSE%' or `ten_chuyen_nganh` LIKE '%MCSE%'
---
    public function view(): View
    {
    	$search = Request::get('search');

    	$array_mon_hoc = MonHoc::query()->join('chuyen_nganh','mon_hoc.ma_chuyen_nganh','=','chuyen_nganh.ma_chuyen_nganh');
    	if(isset($search)){
    		$array_mon_hoc = $array_mon_hoc->where('ten_mon_hoc','LIKE','%'.$search.'%')
							->orWhere('ten_chuyen_nganh','LIKE','%'.$search.'%');
    	}
    	$array_mon_hoc = $array_mon_hoc->get();