app/Http/Controllers/ChuyenNganhController.php

select count(*) as aggregate from `chuyen_nganh` where `ten_chuyen_nganh` LIKE '%quản%'
select * from `chuyen_nganh` where `ten_chuyen_nganh` LIKE '%quản%' order by `ma_chuyen_nganh` desc limit 5 offset 0
---
	public function view_all(Request $req)
	{
		$ten_chuyen_nganh = Input::get('ten_chuyen_nganh');

		$array_chuyen_nganh = ChuyenNganh::query();
		if($ten_chuyen_nganh != '' ){
			$array_chuyen_nganh = $array_chuyen_nganh->where('ten_chuyen_nganh','LIKE','%'.$ten_chuyen_nganh.'%');
		}
		$array_chuyen_nganh = $array_chuyen_nganh->orderBy('ma_chuyen_nganh','desc')->paginate(3);

		$array_chuyen_nganh->appends(array('ten_chuyen_nganh' => Input::get('ten_chuyen_nganh')));

select count(*) as aggregate from `chuyen_nganh` where `ten_chuyen_nganh` = 'Quản lý chuyên ngành'
insert into `chuyen_nganh` (`ten_chuyen_nganh`, `updated_at`, `created_at`) values ('Quản lý chuyên ngành', '2020-08-12 08:41:59', '2020-08-12 08:41:59')
---
	public function process_insert()
	{
		$chuyen_nganh = new ChuyenNganh();
		$chuyen_nganh->ten_chuyen_nganh = Request::get('ten_chuyen_nganh');

		$count = ChuyenNganh::where('ten_chuyen_nganh','=',$chuyen_nganh->ten_chuyen_nganh)->count();

		if($count == 0){
			$chuyen_nganh->save();

select count(*) as aggregate from `chuyen_nganh` where `ten_chuyen_nganh` = 'Quản trị kinh doanh'
update `chuyen_nganh` set `ten_chuyen_nganh` = 'Quản trị kinh doanh', `updated_at` = '2020-08-12 08:42:15' where `ma_chuyen_nganh` = '8'
---
	public function process_update()
	{
		$ma_chuyen_nganh = Request::get('ma_chuyen_nganh');
		$ten_chuyen_nganh = Request::get('ten_chuyen_nganh');

		$count = ChuyenNganh::where('ten_chuyen_nganh','=',$ten_chuyen_nganh)->count();

		if($count == 0){
			ChuyenNganh::where('ma_chuyen_nganh','=',$ma_chuyen_nganh)
					->update(['ten_chuyen_nganh' => $ten_chuyen_nganh]);

select * from `chuyen_nganh` where `ma_chuyen_nganh` = '8' limit 1
---
	public function get_one()
	{
		$ma_chuyen_nganh = Request::get('ma_chuyen_nganh');
		$chuyen_nganh = ChuyenNganh::where('ma_chuyen_nganh','=',$ma_chuyen_nganh)->first();