app/Http/Controllers/Controller.php

    public function process_login()
    {
        $giao_vu = GiaoVu::query()->where('username','=',Request::get('username'))->first();
---
select * from `giao_vu` where `username` = 'dxs' limit 1