app/Http/Controllers/KhoaHocController.php

select count(*) as aggregate from `khoa_hoc`
select * from `khoa_hoc` order by `ma_khoa_hoc` desc limit 5 offset 0
---
	public function view_all(Request $req)
	{
		$ten_khoa_hoc = Input::get('ten_khoa_hoc');

		$array_khoa_hoc = KhoaHoc::query();
		if($ten_khoa_hoc != '' ){
			$array_khoa_hoc = $array_khoa_hoc->where('ten_khoa_hoc','LIKE','%'.$ten_khoa_hoc.'%');
 		}

		$array_khoa_hoc = $array_khoa_hoc->orderBy('ma_khoa_hoc','desc')->paginate(2);

		$array_khoa_hoc->appends(array('ten_khoa_hoc' => Input::get('ten_khoa_hoc')));

select count(*) as aggregate from `khoa_hoc` where `ten_khoa_hoc` = 'Khoá 5'
insert into `khoa_hoc` (`ten_khoa_hoc`, `updated_at`, `created_at`) values ('Khoá 5', '2020-08-12 08:42:34', '2020-08-12 08:42:34')
---
	public function process_insert()
	{
		$khoa_hoc = new KhoaHoc();
		$khoa_hoc->ten_khoa_hoc = Request::get('ten_khoa_hoc');

		$count = KhoaHoc::where('ten_khoa_hoc','=',$khoa_hoc->ten_khoa_hoc)->count();

		if($count == 0){
			$khoa_hoc->save();

select count(*) as aggregate from `khoa_hoc` where `ten_khoa_hoc` = 'Khoá 4'
update `khoa_hoc` set `ten_khoa_hoc` = 'Khoá 4', `updated_at` = '2020-08-12 08:42:38' where `ma_khoa_hoc` = '4'
---
	public function process_update()
	{
		$ma_khoa_hoc = Request::get('ma_khoa_hoc');
		$ten_khoa_hoc = Request::get('ten_khoa_hoc');

		$count = KhoaHoc::where('ten_khoa_hoc','=',$ten_khoa_hoc)->count();

		if($count == 0){
			KhoaHoc::where('ma_khoa_hoc','=',$ma_khoa_hoc)
					->update(['ten_khoa_hoc' => $ten_khoa_hoc]);

select * from `khoa_hoc` where `ma_khoa_hoc` = '4' limit 1
---
	public function get_one()
	{
		$ma_khoa_hoc = Request::get('ma_khoa_hoc');
		$khoa_hoc = KhoaHoc::where('ma_khoa_hoc','=',$ma_khoa_hoc)->first();