app/Http/Controllers/LopController.php

	public function view_all()
	{
		$array_khoa_hoc = KhoaHoc::all();
		$array_chuyen_nganh = ChuyenNganh::all();
		$countSinhVien = new \Sofa\Eloquence\Subquery(
		    SinhVien::from('sinh_vien')
		        ->selectRaw('count(*)')->whereRaw('ma_lop = lop.ma_lop'),
		    'sy_so'
		);

		$search = Input::get('search');

		$array_lop = Lop::from('lop')
			        ->select('*', $countSinhVien)
			        ->addBinding($countSinhVien->getBindings(), 'select')
			        ->join('khoa_hoc','lop.ma_khoa_hoc','=','khoa_hoc.ma_khoa_hoc')
			        ->join('chuyen_nganh','lop.ma_chuyen_nganh','=','chuyen_nganh.ma_chuyen_nganh');
		if($search != ''){
			$array_lop = $array_lop->where('ten_lop','LIKE','%'.$search.'%')
				->orWhere('ten_khoa_hoc','LIKE','%'.$search.'%')
				->orWhere('ten_chuyen_nganh','LIKE','%'.$search.'%');
		}

		$array_lop = $array_lop->orderBy('ma_lop','desc')->paginate(5);
---
select * from `khoa_hoc`
select * from `chuyen_nganh`
select count(*) as aggregate from `lop` inner join `khoa_hoc` on `lop`.`ma_khoa_hoc` = `khoa_hoc`.`ma_khoa_hoc` inner join `chuyen_nganh` on `lop`.`ma_chuyen_nganh` = `chuyen_nganh`.`ma_chuyen_nganh`

	public function process_insert()
	{
		$lop = new Lop();
		$lop->ten_lop = Request::get('ten_lop');
		$lop->ma_khoa_hoc = Request::get('ma_khoa_hoc');
		$lop->ma_chuyen_nganh = Request::get('ma_chuyen_nganh');

		$count = Lop::where('ten_lop','=',$lop->ten_lop)->count()
					->where('ma_khoa_hoc','=',$ma_khoa_hoc)
					->where('ma_chuyen_nganh','=',$ma_chuyen_nganh)->count();

		if($count == 0) {
			$lop->save();
---
insert into `lop` (`ten_lop`, `ma_khoa_hoc`, `ma_chuyen_nganh`, `updated_at`, `created_at`) values ('bkc01k4', '4', '8', '2020-08-12 08:44:06', '2020-08-12 08:44:06')

	public function process_update()
	{
		$ma_lop = Request::get('ma_lop');
		$ten_lop = Request::get('ten_lop');
		$ma_khoa_hoc = Request::get('ma_khoa_hoc');
		$ma_chuyen_nganh = Request::get('ma_chuyen_nganh');

		$count = Lop::where('ten_lop','=',$ten_lop)
					->where('ma_khoa_hoc','=',$ma_khoa_hoc)
					->where('ma_chuyen_nganh','=',$ma_chuyen_nganh)->count();

		if($count == 0) {
			Lop::where('ma_lop','=',$ma_lop)
				->update([
							'ten_lop' => $ten_lop,
							'ma_khoa_hoc' => $ma_khoa_hoc,
							'ma_chuyen_nganh' => $ma_chuyen_nganh
						]);
---
select count(*) as aggregate from `lop` where `ten_lop` = 'bkc01k4' and `ma_khoa_hoc` = '2' and `ma_chuyen_nganh` = '8'
update `lop` set `ten_lop` = 'bkc01k4', `ma_khoa_hoc` = '2', `ma_chuyen_nganh` = '8', `updated_at` = '2020-08-12 08:44:11' where `ma_lop` = '17'

	public function get_one()
	{
		$ma_lop = Request::get('ma_lop');
---
select * from `lop` where `ma_lop` is null limit 1