app/Http/Controllers/LopController.php

select count(*) as aggregate from `lop` where `ten_lop` = 'bkc01k4'
---
	public function process_update()
	{
		$ma_lop = Request::get('ma_lop');
		$ten_lop = Request::get('ten_lop');
		$ma_khoa_hoc = Request::get('ma_khoa_hoc');

		$count = Lop::where('ten_lop','=',$ten_lop)->count();