app/Http/Controllers/MonHocController.php

	public function view_all()
	{
		$array_chuyen_nganh = ChuyenNganh::all();

		$search = Input::get('search');

		$array_mon_hoc = MonHoc::query()
			->join('chuyen_nganh','mon_hoc.ma_chuyen_nganh','=','chuyen_nganh.ma_chuyen_nganh');

		if($search != ''){
			$array_mon_hoc = $array_mon_hoc->where('ten_mon_hoc','LIKE','%'.$search.'%')
							->orWhere('ten_chuyen_nganh','LIKE','%'.$search.'%');
		}

		$array_mon_hoc = $array_mon_hoc->orderBy('ma_mon_hoc','desc')->paginate(5);
---
select * from `chuyen_nganh`
select * from `mon_hoc` inner join `chuyen_nganh` on `mon_hoc`.`ma_chuyen_nganh` = `chuyen_nganh`.`ma_chuyen_nganh` where `ten_mon_hoc` LIKE '%MCSE%' or `ten_chuyen_nganh` LIKE '%MCSE%' order by `ma_mon_hoc` desc limit 5 offset 0
select count(*) as aggregate from `mon_hoc` inner join `chuyen_nganh` on `mon_hoc`.`ma_chuyen_nganh` = `chuyen_nganh`.`ma_chuyen_nganh` where `ten_mon_hoc` LIKE '%MCSE%' or `ten_chuyen_nganh` LIKE '%MCSE%'

	public function process_insert()
	{
		$mon_hoc = new MonHoc();
		$mon_hoc->ten_mon_hoc = Request::get('ten_mon_hoc');
		$mon_hoc->ma_chuyen_nganh = Request::get('ma_chuyen_nganh');

		$count = MonHoc::where('ten_mon_hoc','=',$mon_hoc->ten_mon_hoc)
						->where('ma_chuyen_nganh','=',$mon_hoc->ma_chuyen_nganh)
						->count();
		if($count == 0) {
			$mon_hoc->save();
---
select count(*) as aggregate from `mon_hoc` where `ten_mon_hoc` = 'Nguyên lý kế toán' and `ma_chuyen_nganh` = '8'
insert into `mon_hoc` (`ten_mon_hoc`, `ma_chuyen_nganh`, `updated_at`, `created_at`) values ('Nguyên lý kế toán', '8', '2020-08-12 08:43:09', '2020-08-12 08:43:09')

 	public function get_one()
	{
		$ma_mon_hoc = Request::get('ma_mon_hoc');
		$mon_hoc = MonHoc::where('ma_mon_hoc','=',$ma_mon_hoc)->first();
---
select * from `mon_hoc` where `ma_mon_hoc` = '15' limit 1