app/Http/Controllers/SinhVienController.php

	public function view_all(Request $request)
	{
		$array_lop = Lop::all();
		$array_khoa_hoc = KhoaHoc::all();

		$search = Input::get('search');

		$array_sinh_vien = SinhVien::query()->join('lop','sinh_vien.ma_lop','=','lop.ma_lop');
		if($search != ''){
			$array_sinh_vien = $array_sinh_vien->where('ten_sinh_vien','LIKE','%'.$search.'%')
				->orWhere('ten_lop','LIKE','%'.$search.'%');
		}
		$array_sinh_vien = $array_sinh_vien->orderBy('ma_sinh_vien','desc')->paginate(5);
---
select * from `khoa_hoc`
select * from `sinh_vien` inner join `lop` on `sinh_vien`.`ma_lop` = `lop`.`ma_lop` order by `ma_sinh_vien` desc limit 5 offset 0
select count(*) as aggregate from `sinh_vien` inner join `lop` on `sinh_vien`.`ma_lop` = `lop`.`ma_lop`

	public function danh_sach_sinh_vien_by_lop(Request $request)
	{
		$ma_lop = $request->get('ma_lop');

		$countSinhVien = new \Sofa\Eloquence\Subquery(
		    SinhVien::from('sinh_vien')
		        ->selectRaw('count(*)')->where('ma_lop', '=', $ma_lop),
		    'sy_so'
		);

		$array_sinh_vien = SinhVien::from('sinh_vien')
							    ->select('*', $countSinhVien)
						        ->addBinding($countSinhVien->getBindings(), 'select')
						        ->join('lop','lop.ma_lop','=','sinh_vien.ma_lop')
								->where('sinh_vien.ma_lop','=',$ma_lop)
								->orderBy('ma_sinh_vien','desc')
								->paginate(5);
---
select *, (select count(*) from `sinh_vien` where `ma_lop` = '16') as `sy_so` from `sinh_vien` inner join `lop` on `lop`.`ma_lop` = `sinh_vien`.`ma_lop` where `sinh_vien`.`ma_lop` = '16' order by `ma_sinh_vien` desc limit 5 offset 5
select count(*) as aggregate from `sinh_vien` inner join `lop` on `lop`.`ma_lop` = `sinh_vien`.`ma_lop` where `sinh_vien`.`ma_lop` = '16'